Repository: Piwigo/Piwigo-Mobile
Catalog: piwigo/Resources/ReleaseNotes.xcstrings
Source language: en
Languages: ar, da, de, es, fr, hu, id, it, ja, nl, pl, ru, sv, zh_hans, zh_hant

# v4.0.0_text
source: Version 4.0 September 15, 2025 • iOS 26 compatibility • Minor bug fixes and improvements of the interface
ar: الإصدار 4.0 15 سبتمبر 2025 • توافق iOS 26 • إصلاحات الشوائب طفيفة والتحسينات في الواجهة
da: Version 4.0 15 september 2025 • iOS 26 kompabilitet • Mindre fejl rettet og forbedringer af brugerflade
de: Version 4.0 15. September 2025 • iOS 26-Kompatibilität • Kleine Fehlerbeseitigungen und Verbesserungen der Schnittstelle
es: Versión 4.0 15 de septiembre de 2025 • Compatibilidad con iOS 26 • Corrección de errores menores y mejoras en la interfaz
fr: Version 4.0 15 septembre 2025 • Compatibilité avec iOS 26 • Corrige des bugs mineurs et améliore l'interface
hu: 4.0-as verzió September 15, 2025 • iOS 26 kompatibilitás • Kisebb hibajavítások és fejlesztések a felületen
id: Version 4.0 15 September 2025 • Kompatibilitas iOS 26 • Perbaikan bug minor dan perbaikan antarmuka
it: Versione 4.0 15 settembre 2025 • Compatibilità iOS 26 • Correzioni di bug minori e miglioramenti dell'interfaccia
ja: バージョン 4.0 2025年9月15日 • iOS 26の互換性 • 軽微なバグの修正とインタフェースの改善
nl: Versie 4.0 15 September 2025 • iOS 26-compatibiliteit • Kleine foutjes hersteld en verbetering van de interface
pl: Wersja 4.0 15 września 2025 • Kompatybilność z iOS 26 • Drobne poprawki błędów i ulepszenia interfejsu
ru: Версия 4.0 15 сентября 2025 • совместимость с iOS 26 • Исправления и улучшения интерфейса
sv: Version 4.0 15 september 2025 • iOS 26-kompatibilitet • Mindre bugfixar och förbättringar av gränssnittet
zh_hans: 版本4.0 2025年9月15日 • 支持iOS 26 • 错误修复和界面改进
zh_hant: 版本 4.0 2025年9月15日 • 支援iOS 26 • 小型錯誤修正及介面改進

# v4.1.0_text
source: Version 4.1 • Brings support for Larger Text • Fixes bugs and improves the interface
ar: الإصدار 4.1 • يدعم النصوص الكبيرة • يصلح الأخطاء ويحسن الواجهة
da: Version 4.1 • Understøtter større skrifttyper • Mindre fejl rettet og forbedringer af brugerflade
de: Version 4.1 • Unterstützt größere Schriftarten • Behebung von Fehlern und Verbesserung der Benutzeroberfläche
es: Versión 4.1 • Admite fuentes más grandes • Corrige errores y mejora la interfaz
fr: Version 4.1 • Prend en charge des polices plus grandes • Corrige les bugs et améliore l'interface
hu: 4.1-es verzió • Nagyobb betűméret támogatása • Hibák javítása és a felület javítása
id: Versi 4.1 • Mendukung font yang lebih besar • Memperbaiki bug dan meningkatkan antarmuka
it: Versione 4.1 • Supporta caratteri più grandi • Corregge i bug e migliora l'interfaccia
ja: バージョン 4.1 • 大きなフォントのサポート • バグの修正とインターフェイスの改善
nl: Versie 4.1 • Brings ondersteuning voor grotere tekst • Verbetert bugs en verbetert de interface
pl: Wersja 4.1 • Obsługa większych czcionek • Naprawiono błędy i ulepszono interfejs
ru: Версия 4.1 • Поддержка более крупных шрифтов. • Исправлены ошибки и улучшен интерфейс
sv: Version 4.1 • Stöder större teckensnitt • Fixar buggar och förbättrar gränssnittet
zh_hans: 版本4.1 • 支持更大字号的字体 • 修复了错误并改进了界面
zh_hant: 版本 4.1 • 支援更大尺寸的字型 • 錯誤修正與介面改進

# v2.4.0_text
source: Version 2.4 July 15, 2019 • Adds a search tool (requires iOS 11 or later) • Adds photo sorting by rating score • Faster download of album thumbnails (requires Piwigo 2.8 or later) • Titles of uploaded photos do not default to filenames anymore • Fixes impossibility to remove tags • Fixes inaccurate photo data in some circumstances
da: Version 2.4 15 juli 2019 • Tilføjer et søgeværktøj (kræver iOS 11 eller nyere) • Tilføjer billed sortering efter bedømmelse score • Hurtigere download af album miniaturer (kræver Piwigo 2.8 eller nyere) • Titler af uploadede billeder er ikke længere som standard filnavne • Løser fejl med sletning af etiketer • Løser unøjagtige billeddata under visse omstændigheder
de: Version 2.4 15. Juli 2019 • Fügt ein Suchwerkzeug hinzu (erfordert iOS 11 oder neuer) • Fügt eine ortierung nach Bewertungspunktzahl hinzu • Schnellerer Download von Album-Thumbnails (erfordert Piwigo 2.8 oder neuer) • Titel von hochgeladenen Fotos sind nicht mehr standardmäßig Dateinamen • Behebt die Unmöglichkeit, Tags zu entfernen • Korrigiert unter bestimmten Umständen ungenaue Fotodaten
es: Versión 2.4 15 de julio 2019 • Añade una herramienta de búsqueda (requiere iOS 11 o superior) • Añade la clasificación de las fotos por puntuación • Descarga más rápida de las miniaturas del álbum (requiere Piwigo 2.8 o posterior) • Los títulos de las fotos subidas ya no son por defecto los nombres de archivo • Corrección de la imposibilidad de eliminar etiquetas • Arregla datos de fotos inexactos en algunas circunstancias
fr: Version 2.4 15 juillet 2019 • Ajoute un outil de recherche (nécessite iOS 11+) • Ajoute le tri des photos par note • Accélère le téléchargement des vignettes d'albums (nécessite Piwigo 2.8 ou version ultérieure) • Les titres des photos téléversées ne sont plus des noms de fichiers par défaut • Corrige l'impossibilité de supprimer les balises • Corrige les données de photos inexactes dans certaines circonstances
hu: 2.4-es verzió 2019 Július 15 • Elérhető lett a keresés (iOS 11 vagy újabb esetén) • Fotók értékelési pontszám alapján történő rendezése • Album-index képek gyorsabb letöltése (Piwigo 2.8 vagy újabb esetén) • A feltöltött képek nevei mostantól nem a fájlnevet használják alapértelmezettként • Javítja a hibát, amitől a címkéket nem lehetett eltávolítani • Javítja az esetenkénti pontatlan fotóadatok hibáját
id: Versi 2.4 15 Juli 2019 • Menambahkan alat pencarian (membutuhkan iOS 11 atau lebih baru) • Menambahkan penyortiran gambar berdasarkan skor penilaian • Unduhan thumbnail album lebih cepat (membutuhkan Piwigo 2.8 atau lebih baru) • Judul gambar yang diunggah sudah tidak lagi menjadi nama file • Memperbaiki ketidakmungkinan untuk menghapus tag • Memperbaiki data gambar yang tidak akurat dalam beberapa keadaan
it: Versione 2.4 15 luglio 2019 • Aggiunge uno strumento di ricerca (richiede iOS 11 o successivo) • Aggiunge l'ordinamento delle immagini per punteggio • Download più rapido delle miniature degli album (richiede Piwigo 2.8 o successivo) • I titoli delle immagini caricate non hanno più impostazioni predefinite per i nomi dei file • Risolve l'impossibilità di rimuovere i tag • Risolve i dati dell'immagine imprecisi in alcune circostanze
ja: バージョン2.4 2019年7月15日 •検索ツールを追加する（iOS 11以降が必要） •評価スコアによる写真の並べ替えを追加する •アルバムのサムネイルの高速ダウンロード（Piwigo 2.8以降が必要） •アップロードされた写真のタイトルがデフォルトのファイル名にならなくなりました •タグを削除できない問題を修正する •状況によっては不正確な写真データを修正する
nl: Versie 2.4 15 Juli 2019 • Voegt een zoekfunctie toe (vereist iOS 11 of hoger) • Voegt beeldsortering toe op scorewaarde • Sneller downloaden van albumminiaturen (vereist Piwigo 2.8 of hoger) • Titels van geüploade afbeeldingen veranderen niet meer standaard in bestandsnamen • Lost onmogelijkheid op om tags te verwijderen • Corrigeert in sommige omstandigheden onnauwkeurige afbeeldingsgegevens
pl: Wersja 2.4 15 lipca 2019 • Dodaje narzędzie wyszukiwania (wymaga systemu iOS 11 lub nowszego) • Dodaje sortowanie zdjęć według wyniku oceny • Szybsze pobieranie miniatur albumów (wymaga Piwigo 2.8 lub nowszego) • Tytuły przesłanych zdjęć nie są już domyślnie nazwami plików • Naprawiono niemożność usunięcia znaczników • Naprawia niedokładności informacji o zdjęciu w niektórych okolicznościach
ru: Версия 2.4 15 июля, 2019 • Добавляет инструмент поиска (требует iOS 11 или выше) • Добавляет сортировку фотографий по рейтингу • Быстрая загрузка эскизов альбомов (требует Piwigo 2. или позже) • Заголовки загруженных фотографий больше не по умолчанию для имен файлов • Исправления невозможности удаления тегов • Исправление неточных фотографий в некоторых случаях
sv: Version 2.4 15 juli 2019 • Lägger till ett sökverktyg (kräver iOS 11 eller senare) • Lägger till bildsortering med betygsättning • Snabbare nedladdning av miniatyrer i albumet (kräver Piwigo 2.8 eller senare) • Titlar på uppladdade bilder går inte längre till filnamn längre • Fixar omöjligt att ta bort taggar • Löser felaktiga bilddata under vissa omständigheter
zh_hans: 版本2.4 2019年7月15日 • 新增搜索工具（需要iOS11及以后的版本） • 新增按评分排序照片的功能 • 加速相册封面的下载速度（需要Piwigo 2.8及以后的版本） • 上传照片的名称不再默认为文件名 • 修复无法移除标签的BUG • 修复特定情况下照片数据的错误
zh_hant: 版本 2.4 2019年7月15日 • 新增搜尋工具(需要iOS 11以上) • 新增以評分排序功能 • 更快的下載相簿封面(需要Piwigo 2.8以上) • 上傳照片的預設名稱不再是檔名 • 修正不能移除標籤的問題 • 小型錯誤修正及介面改進

# v2.4.1_text
source: Version 2.4.1 August 10, 2019 • Adds "Tags", "Most visited", "Best rated" and "Recent photos" albums • Minor bug fixes and improvements of the interface
da: Version 2.4.1 10 august 2019 • Tilføjer albummer "Etiketter", "Mest sete", "Bedst bedømte" og "Nye fotografier" • Mindre fejlrettelser og forbedringer af brugerflade
de: Version 2.4.1 10. August 2019 • Fügt die Alben "Schlagwörter", "Am häufigsten angesehen", "Am besten bewertet" und "Neueste " hinzu • Kleinere Fehlerbeseitigungen und Verbesserungen im Interface
es: Versión 2.4.1 10 de agosto de 2019 • Añade "Etiquetas", "Más visitado", Álbumes de "Mejor valoración" y "Fotos recientes" • Corrección de errores menores y mejoras en la interfaz
fr: Version 2.4.1 10 août 2019 • Ajoute les albums "Tags", "Plus vues", "Mieux notées" et "Photos récentes" • Corrige des bugs mineurs et améliore l'interface
hu: 2.4.1-es verzió 2019 Augusztus 10 • Elérhetőek lettek a "címkék", "legtöbbet látogatott", "legjobbra értékelt", és "új fotók" albumok • Kisebb hibajavítások és fejlesztések a felületen
id: Versi 2.4.1 10 Agustus, 2019 • Menambahkan album "Tag", "Paling sering dikunjungi", "Nilai terbaik" dan "Foto terbaru" • Perbaikan bug minor dan perbaikan antarmuka
it: Versione 2.4.1 10 agosto 2019 • Aggiunge gli album "Tags", "Le più viste", "I più votati" e "Ultime foto" • Correzioni di bug minori e miglioramento dell'interfaccia
ja: バージョン2.4.1 2019年8月10日 • "タグ", "最多アクセス"、 "最高評価"、 "最近の写真"アルバムを追加 • 軽微なバグの修正とインタフェースの改善
nl: Versie 2.4.1 • Voegt albums "Labels", "Meest bezocht", "Best gewaardeerd" en "Recente foto's" toe • Kleine foutjes verbeterd en verbetering van de interface
pl: Wersja 2.4.1 10 sierpnia 2019 • Dodaje albumy „Znaczniki”, „Najczęściej odwiedzane”, „Najlepiej oceniane” i „Najnowsze zdjęcia” • Drobne poprawki błędów i ulepszenia interfejsu
ru: Версия 2.4.1 10 августа 2019 • Добавляет "Метки", "Самые посещаемые", Альбомы "Лучшая оценка" и "Последние фотографии" • Незначительные исправления и улучшения интерфейса
sv: Version 2.4.1 10 augusti 2019 • Lägger till album "Etiketter", "Mest besökta", "Högst betygsatta" och "Senaste bilder" • Mindre buggfixar och förbättring av gränssnittet
zh_hans: 版本2.4.1 2019年8月10日 • 添加 "标签", "最多可视化", “最佳评分”和“最近照片”相册 • 错误修复和界面改进
zh_hant: 版本 2.4.1 2019年8月10日 • 新增"標籤"，"最多觀看"，"最高評分"，"最近的照片"相簿 • 小型錯誤修正及介面改進

# v2.4.2_text
source: Version 2.4.2 September 3, 2019 • Adds ability to create tags (admin users only) • Adds ability to change size of album thumbnails • Adds Retina display management • Minor bug fixes and improvements of the interface
da: Version 2.4.2 3 september 2019 • Mulighed for oprettelse af etiketter (kun admin brugere) • Mulighed for ændring af album miniature størrelse • Retina display management tilføjet • Mindre fejl rettet og forbedringer af brugerflade
de: Version 2.4.2 3. September 2019 • Fügt die Fähigkeit hinzu, Stichwörter (nur Administratoren) zu erstellen • Fügt die Fähigkeit ein, die Größe der Miniaturfotos zu ändern • Retina Display Verwaltung • Kleine Fehlerbeseitigungen und Verbesserungen der Schnittstelle
es: Versión 2.4.2 3 de septiembre 2019 • Añade la posibilidad de crear etiquetas (sólo usuarios administradores) • Añade la posibilidad de cambiar el tamaño de las miniaturas del álbum • Añade la gestión de pantalla de Retina • Corrección de errores menores y mejoras en la interfaz
fr: Version 2.4.2 3 septembre 2019 • Ajoute la possibilité de créer des tags (pour administrateurs seulement) • Ajoute la possibilité de changer la taille des vignettes d'album • Ajoute la gestion des écrans Retina • Corrige des bugs mineurs et améliore l'interface
hu: 2.4.2-es verzió 2019 Szeptember 3 • Admin felhasználók létrehozhatnak címkéket • Lehetőség az albumok indexkép-méretének változtatására • Retinaképernyő-menedzsment • Kisebb hibajavítások és fejlesztések a felületen
id: Versi 2.4.2 3 September 2019 • Menambahkan kemampuan untuk membuat tag (hanya pengguna admin) • Menambahkan kemampuan untuk mengubah ukuran thumbnail album • Menambahkan manajemen tampilan Retina • Perbaikan bug minor dan peningkatan antarmuka
it: Versione 2.4.2 3 settembre 2019 • Aggiunge la possibilità di creare tag (solo utenti amministratori) • Aggiunge la possibilità di modificare le dimensioni delle miniature degli album • Aggiunge la gestione del display Retina • Correzioni di bug minori e miglioramenti dell'interfaccia
ja: バージョン 2.4.2 2019年9月3日 • タグを作成する機能を追加（管理者ユーザのみ） • アルバムサムネールのサイズを変更する機能を追加 • Retinaディスプレイ管理を追加 • 軽微なバグの修正とインタフェースの改善
nl: Versie 2.4.2 3 September 2019 • Voegt de mogelijkheid om labels te maken toe (alleen voor admin gebruikers) • Voegt de mogelijkheid om de grootte van de album-miniaturen te veranderen • Voegt Retina beeldscherm-management toe • Kleine foutjes hersteld en verbetering van de interface
pl: Wersja 2.4.2 3 września 2019 • Dodaje możliwość tworzenia znaczników (tylko użytkownicy administracyjni) • Dodaje możliwość zmiany rozmiaru miniatur albumów • Dodaje zarządzanie wyświetlaniem Retina • Drobne poprawki błędów i ulepszenia interfejsu
ru: Версия 2.4.2 3 сентября 2019 • Добавляет возможность создавать теги (только для администратора) • Добавляет возможность изменять размер эскизов альбомов • Добавляет управление отображением сетчатки • Исправления мелких ошибок и улучшения интерфейса
sv: Version 2.4.2 3 september 2019 • Lägger till förmågan att skapa taggar (endast adminanvändare) • Lägger till möjligheten att ändra storlek på albumminiatyrerna • Lägger till retina-displayhantering • Mindre bugfixar och förbättringar av gränssnittet
zh_hans: 版本2.4.2 2019年9月3日 • 增加创建标签的功能(仅限管理员用户) • 增加更改相册缩略图大小的功能 • 增加Retina显示管理 • 错误修复和界面改进
zh_hant: 版本 2.4.2 2019年9月3日 • 新增建立標籤的功能(僅限管理員) • 新增更改相簿封面尺寸的功能 • 新增Retina顯示器的管理功能 • 小型錯誤修正及介面改進

# v2.4.3_text
source: Version 2.4.3 September 25, 2019 • iOS 13 compatibility • Minor bug fixes and improvements of the interface
da: Version 2.4.3 25 september 2019 • iOS 13 kompabilitet • Mindre fejl rettet og forbedringer af brugerflade
de: Version 2.4.3 25. September 2019 • iOS 13-Kompatibilität • Kleine Fehlerbeseitigungen und Verbesserungen der Schnittstelle
es: Versión 2.4.3 25 de septiembre de 2019 • Compatibilidad con iOS 13 • Corrección de errores menores y mejoras en la interfaz
fr: Version 2.4.3 25 septembre 2019 • Compatibilité avec iOS 13 • Corrige des bugs mineurs et améliore l'interface
hu: 2.4.3-as verzió 2019 Szeptember 25 • iOS 13 kompatibilitás • Kisebb hibajavítások és fejlesztések a felületen
id: Version 2.4.3 25 September 2019 • Kompatibilitas iOS 13 • Perbaikan bug minor dan perbaikan antarmuka
it: Versione 2.4.3 25 settembre 2019 • Compatibilità iOS 13 • Correzioni di bug minori e miglioramenti dell'interfaccia
ja: バージョン 2.4.3 2019年9月25日 • iOS 13の互換性 • 軽微なバグの修正とインタフェースの改善
nl: Versie 2.4.3 25 September 2019 • iOS 13-compatibiliteit • Kleine foutjes hersteld en verbetering van de interface
pl: Wersja 2.4.3 25 września 2019 • Kompatybilność z iOS 13 • Drobne poprawki błędów i ulepszenia interfejsu
ru: Версия 2.4.3 25 сентября 2019 • совместимость с iOS 13 • Исправления и улучшения интерфейса
sv: Version 2.4.3 25 september 2019 • iOS 13-kompatibilitet • Mindre bugfixar och förbättringar av gränssnittet
zh_hans: 版本2.4.3 2019年9月25日 • 支持iOS 13 • 错误修复和界面改进
zh_hant: 版本 2.4.3 2019年9月25日 • 支援iOS 13 • 小型錯誤修正及介面改進

# v2.4.4_text
source: Version 2.4.4 October 1, 2019 • Fix video upload issues on some servers • Minor bug fixes and improvements of the interface
da: Version 2.4.4 1 oktober 2019 • Løst videooverførselsproblemer på nogle servere • Mindre fejl rettet og forbedringer af brugerflade
de: Version 2.4.4 1. Oktober 2019 • Behebt Probleme beim Hochladen von Videos auf einigen Servern • Kleine Fehlerbeseitigungen und Verbesserungen der Schnittstelle
es: Versión 2.4.4 1 de octubre de 2019 • Corrección de problemas en la subida de vídeos en algunos servidores • Corrección de errores menores y mejoras en la interfaz
fr: Version 2.4.4 1er octobre 2019 • Résout les problèmes de téléchargement de vidéos sur certains serveurs • Corrige des bugs mineurs et améliore l'interface
hu: 2.4.4-es verzió 2019 Október 1 • Videó-feltöltés problémáinak javítása néhány szerver esetében • Kisebb hibajavítások és fejlesztések a felületen
id: Version 2.4.4 1 Oktober, 2019 • Perbaiki masalah upload video di beberapa server • Perbaikan bug minor dan perbaikan antarmuka
it: Versione 2.4.4 1 ottobre 2019 • Risolti problemi di caricamento dei video su alcuni server • Correzioni di bug minori e miglioramenti dell'interfaccia
ja: バージョン 2.4.4 2019年10月1日 • 幾つかのサーバにおける動画アップロード問題の解決 • 軽微なバグの修正とインタフェースの改善
nl: Versie 2.4.4 1 Oktober 2019 • Problemen met video-uploads op sommige servers oplossen • Kleine foutjes hersteld en verbetering van de interface
pl: Wersja 2.4.4 1 października 2019 • Naprawia problemy z przesyłaniem wideo na niektórych serwerach • Poprawki drobnych błędów i ulepszenia interfejsu
ru: Версия 2.4.4 1 октября 2019 • Исправлена проблема загрузки видео на некоторых серверах • Исправления мелких ошибок и улучшения интерфейса
sv: Version 2.4.4 1 oktober 2019 • Fixa problem med videouppladdningar på vissa servrar • Mindre bugfixar och förbättringar av gränssnittet
zh_hans: 版本 2.4.4 2019年10月1日 • 修复部分服务器可能会遇到的视频上传问题 • 错误修复和界面改进
zh_hant: 版本 2.4.4 2019年10月1日 • 修正在部分伺服器上影片上傳的問題 • 小型錯誤修正及介面改進

# v2.4.5_text
source: Version 2.4.5 November 6, 2019 • Displays your favorite photos (requires Piwigo 2.10 or later) • Option for presenting photos sorted manually • Allows Community users to create albums (with appropriate rights) • Minor bug fixes and improvements of the interface
da: Version 2.4.5 6 november 2019 • Viser dine yndlingsbilleder (kræver Piwigo 2.10 eller nyere) • Mulighed for præsentation af billeder sorteret manuelt • Tillader Community-brugere at oprette albums (med passende rettigheder) • Mindre fejl rettet og forbedringer af brugerflade
de: Version 2.4.5 6. November 2019 • Zeigt Ihre Lieblingsfotos an (benötigt Piwigo 2.10 oder höher) • Option für die Darstellung von Fotos manuell sortiert • Ermöglicht Community-Benutzern Alben (mit entsprechenden Rechten) • Kleinere Fehlerbehebungen und Verbesserungen der Benutzeroberfläche
es: Versión 2.4.5 6 de noviembre de 2019 • Muestra sus fotos favoritas (requiere Piwigo 2.10 o posterior) • Opción para presentar las fotos ordenadas manualmente • Permite a los usuarios de la Comunidad crear álbums (con los derechos apropiados) • Corrección de errores menores y mejoras en la interfaz
fr: Version 2.4.5 6 novembre 2019 • Affiche vos photos favorites (nécessite Piwigo 2.10 ou ultérieur) • Option de présentation des photos triées manuellement • Permet aux utilisateurs Community de créer des albums (avec les droits appropriés) • Corrige des bugs mineurs et améliore l'interface
hu: 2.4.5-ös verzió 2019 November 6 • Displays your favorite photos (requires Piwigo 2.10 or later) • Fotók mutatása egyedi rendezés szerint • Közösségi felhasználók is hozhatnak létre albumokat (megfelelő jogosultságok függvényében) • Kisebb hibajavítások és fejlesztések a felületen
id: Version 2.4.5 6 November 2019 • Menampilkan gambar favorit Anda (membutuhkan Piwigo 2.10 atau lebih baru) • Opsi untuk menyajikan gambar yang diurutkan secara manual • Mengizinkan pengguna Community membuat album (dengan hak yang sesuai) • Perbaikan bug minor dan perbaikan antarmuka
it: Versione 2.4.5 6 novembre 2019 • Visualizza le tue immagini preferite (richiede Piwigo 2.10 o successivo) • Opzione per la presentazione manuale delle immagini • Consente agli utenti Community di creare album (con diritti appropriati) • Correzioni di bug minori e miglioramenti dell'interfaccia
ja: バージョン 2.4.5 2019年11月6日 • お気に入りの写真を表示します （Piwigo 2.10以降が必要です） • 手動でソートされた写真を表示するオプション • Communityユーザーがアルバムを作成できるようにします（適切な権限を持つ） • 軽微なバグの修正とインタフェースの改善
nl: Versie 2.4.5 6 November 2019 • Toont uw favoriete afbeeldingen (vereist Piwigo 2.10 of hoger) • Optie voor het handmatig presenteren van afbeeldingen • Hiermee kunnen Community gebruikers albums maken (met de juiste rechten) • Kleine foutjes hersteld en verbetering van de interface
pl: Wersja 2.4.5 6 listopada 2019 • Wyświetla twoje ulubione zdjęcia (wymaga Piwigo 2.10 lub nowszego) • Opcja prezentacji zdjęć posortowanych ręcznie • Pozwala użytkownikom Community (z odpowiednimi uprawnieniami) tworzyć albumy • Poprawki drobnych błędów i ulepszenia interfejsu
ru: Версия 2.4.5 6 ноября 2019 • Отображает ваши любимые фотографии (требует Piwigo 2.10 или позже) • Опция для представления фото отсортировано вручную • Позволяет пользователям сообщества создавать альбомы (с надлежащими правами) • Исправления и улучшения интерфейса
sv: Version 2.4.5 6 november 2019 • Visar dina favoritbilder (kräver Piwigo 2.10 eller senare) • Alternativ för att presentera bilder sorterade manuellt • Tillåter Community-användare att skapa album (med lämpliga rättigheter) • Mindre bugfixar och förbättringar av gränssnittet
zh_hans: 版本 2.4.5 2019年11月6日 • 显示您最喜欢的照片（需要 Piwigo 2.10 或更高版本) • 新增手动展示照片的选项 • 允许社区用户创建相册（在拥有相应许可的情况下） • 错误修复和界面改进
zh_hant: 版本 2.4.5 2019年11月6日 • 顯示你的最愛圖片 (需要Piwigo 2.10以上) • 新增手動排序照片的功能 • 允許社群用戶新增相簿 (前提是擁有足夠權限) • 小型錯誤修正及介面改進
